In [1]:
import pandas as pd
import numpy as np

In [2]:
bf = pd.read_csv("black_friday.csv")

In [3]:
bf.head(2)

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200

In [4]:
bf.tail()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
537572,1004737,P00193542,M,36-45,16,C,1,0,1,2.0,NaN,11664
537573,1004737,P00111142,M,36-45,16,C,1,0,1,15.0,16.0,19196
537574,1004737,P00345942,M,36-45,16,C,1,0,8,15.0,NaN,8043
537575,1004737,P00285842,M,36-45,16,C,1,0,5,NaN,NaN,7172
537576,1004737,P00118242,M,36-45,16,C,1,0,5,8.0,NaN,6875

In [5]:
bf.shape

(537577, 12)

In [6]:
bf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 537577 entries, 0 to 537576
Data columns (total 12 columns):
User_ID                       537577 non-null int64
Product_ID                    537577 non-null object
Gender                        537577 non-null object
Age                           537577 non-null object
Occupation                    537577 non-null int64
City_Category                 537577 non-null object
Stay_In_Current_City_Years    537577 non-null object
Marital_Status                537577 non-null int64
Product_Category_1            537577 non-null int64
Product_Category_2            370591 non-null float64
Product_Category_3            164278 non-null float64
Purchase                      537577 non-null int64
dtypes: float64(2), int64(5), object(5)
memory usage: 49.2+ MB

In [21]:
aux = bf[["Gender", "Age"]]
aux.head(5)

  Gender   Age
0      F  0-17
1      F  0-17
2      F  0-17
3      F  0-17
4      M   55+

In [23]:
aux2 = aux[aux["Gender"] == "F"]

In [24]:
aux2.head()

   Gender    Age
0       F   0-17
1       F   0-17
2       F   0-17
3       F   0-17
14      F  51-55

In [25]:
aux3 = aux2[aux2["Age"] == "26-35"]
aux3.head()

    Gender    Age
47       F  26-35
48       F  26-35
49       F  26-35
124      F  26-35
125      F  26-35

In [28]:
aux3.describe()

       Gender    Age
count   49348  49348
unique      1      1
top         F  26-35
freq    49348  49348

In [31]:
aux3.groupby("Gender")["Age"].value_counts()

Gender  Age
F       26-35    49348
Name: Age, dtype: int64

In [32]:
aux4 = aux3["Age"]
aux4.head()

47     26-35
48     26-35
49     26-35
124    26-35
125    26-35
Name: Age, dtype: object

In [37]:
 resposta= aux4.value_counts()

In [35]:
print(resposta)

26-35    49348
Name: Age, dtype: int64

In [45]:
aux4.head(3)

47    26-35
48    26-35
49    26-35
Name: Age, dtype: object

In [38]:
aux4.count()

49348

In [40]:
aux = bf[["Gender", "Age"]]
aux.head(5)

  Gender   Age
0      F  0-17
1      F  0-17
2      F  0-17
3      F  0-17
4      M   55+

In [41]:
q2 = aux[(aux["Gender"] == "F") & (aux["Age"] == "26-35")]

In [42]:
q2.head()

    Gender    Age
47       F  26-35
48       F  26-35
49       F  26-35
124      F  26-35
125      F  26-35

In [52]:
resposta = q2["Gender"]

In [53]:
print(resposta.count())

49348

In [55]:
q2["Gender"].count()

49348

In [50]:
?count

Object `count` not found.

In [51]:
?.count()

Object `.count()` not found.

In [56]:
df_ids = bf["User_ID"]
df_ids.head()

0    1000001
1    1000001
2    1000001
3    1000001
4    1000002
Name: User_ID, dtype: int64

In [57]:
unique_aux = bf.drop_duplicates(subset = "User_ID")
unique_aux.head(3)

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969
5,1000003,P00193542,M,26-35,15,A,3,0,1,2.0,NaN,15227

In [58]:
q3_answer = unique_aux["User_ID"].count()
q3_answer

5891

In [59]:
bf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 537577 entries, 0 to 537576
Data columns (total 12 columns):
User_ID                       537577 non-null int64
Product_ID                    537577 non-null object
Gender                        537577 non-null object
Age                           537577 non-null object
Occupation                    537577 non-null int64
City_Category                 537577 non-null object
Stay_In_Current_City_Years    537577 non-null object
Marital_Status                537577 non-null int64
Product_Category_1            537577 non-null int64
Product_Category_2            370591 non-null float64
Product_Category_3            164278 non-null float64
Purchase                      537577 non-null int64
dtypes: float64(2), int64(5), object(5)
memory usage: 49.2+ MB

In [61]:
bf.dtypes

User_ID                         int64
Product_ID                     object
Gender                         object
Age                            object
Occupation                      int64
City_Category                  object
Stay_In_Current_City_Years     object
Marital_Status                  int64
Product_Category_1              int64
Product_Category_2            float64
Product_Category_3            float64
Purchase                        int64
dtype: object

In [62]:
bf.dtypes.nunique()

3

In [63]:
bf.isnull().sum()

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2            166986
Product_Category_3            373299
Purchase                           0
dtype: int64

In [64]:
bf.isnull().sum().nunique()

3

In [65]:
df = bf

In [66]:
df.isnull().sum()

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2            166986
Product_Category_3            373299
Purchase                           0
dtype: int64

In [68]:
df_notNA = df.dropna(axis = 0)
df_notNA.isnull().sum()

User_ID                       0
Product_ID                    0
Gender                        0
Age                           0
Occupation                    0
City_Category                 0
Stay_In_Current_City_Years    0
Marital_Status                0
Product_Category_1            0
Product_Category_2            0
Product_Category_3            0
Purchase                      0
dtype: int64

In [70]:
lt = df.shape[0] # numero de linhas totais com as nulas
lt               # inclusas

537577

In [72]:
l_notna = df_notNA.shape[0] #linhas sem as linhas NaN
l_notna

164278

In [73]:
# Linhas NaN
q5 = (lt - l_notna)/lt
q5

0.6944102891306734

In [74]:
help(len)

Help on built-in function len in module builtins:

len(obj, /)
    Return the number of items in a container.

In [75]:
df.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969

In [77]:
df.isnull().sum()

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2            166986
Product_Category_3            373299
Purchase                           0
dtype: int64

In [78]:
df.isnull().sum().max()

373299

In [79]:
df["Product_Category_3"].dropna().mode()

0    16.0
dtype: float64

In [84]:
mode?

Object `mode` not found.

In [85]:
purchase = df["Purchase"]
purchase.describe().T

count    537577.000000
mean       9333.859853
std        4981.022133
min         185.000000
25%        5866.000000
50%        8062.000000
75%       12073.000000
max       23961.000000
Name: Purchase, dtype: float64

In [88]:
def norm(column):
    return ((column - column.min()) / 
            (column.max() - column.min()))

print(df["Purchase"].agg(norm).mean())

0.3847939036269795

In [90]:
norm_purchase = df["Purchase"].agg(norm)

In [94]:
norm_purchase.head()

0    0.344255
1    0.631519
2    0.052027
3    0.036676
4    0.327389
Name: Purchase, dtype: float64

In [95]:
print(norm_purchase.head(5))

0    0.344255
1    0.631519
2    0.052027
3    0.036676
4    0.327389
Name: Purchase, dtype: float64

In [105]:
#padronizar

def stand(column):
        return ((column - column.mean())/
                column.std())
    
df_9 = df["Purchase"].agg(stand) 
df_9.value_counts(sort = True)

-0.497661    186
-0.466342    185
-0.429803    182
-0.490433    182
-0.492843    181
-0.463130    180
-0.466141    180
-0.435425    179
-0.435224    179
-0.492040    179
-0.476581    178
-0.449880    176
-0.497059    176
-0.484009    176
-0.495051    176
-0.450683    176
-0.435023    175
-0.445664    175
-0.431409    174
-0.482403    174
-0.483005    174
-0.456505    174
-0.439239    173
-0.459115    173
-0.473971    173
-0.487824    173
-0.446868    172
-0.478789    171
-0.466543    171
-0.461724    171
            ...
 1.791829      1
-0.907015      1
-1.695407      1
 2.822140      1
-0.001578      1
-1.190290      1
 1.901244      1
 2.281889      1
 0.965493      1
 1.821341      1
-0.847589      1
 0.185934      1
 0.020707      1
-0.022658      1
 1.835595      1
-0.085496      1
-1.704843      1
 0.377661      1
-1.195108      1
 2.934767      1
 2.361391      1
 2.751672      1
-0.537211      1
 1.621583      1
-0.765678      1
-0.890351      1
 2.420816      1
 0.910885      1
 1.898634      1
 0.908275      1
Name: Purchase, Length: 17959, dtype: int64

In [99]:
df_9.describe().T

count    5.375770e+05
mean    -1.632626e-16
std      1.000000e+00
min     -1.836743e+00
25%     -6.962145e-01
50%     -2.553411e-01
75%      5.499153e-01
max      2.936574e+00
Name: Purchase, dtype: float64

In [102]:
aux= 2.936574e+00
df_9[df_9 == aux].count()

0

In [104]:
print(df_9)

0        -0.193506
1         1.177698
2        -1.588401
3        -1.661679
4        -0.274012
5         1.183119
6         1.983758
7         1.308996
8         1.275268
9        -0.293687
10       -0.819081
11       -1.079469
12       -0.654657
13        1.271052
14       -0.794186
15       -1.456500
16        0.747064
17       -0.096940
18        0.492698
19        2.063862
20       -0.150543
21        0.108038
22        0.082140
23       -0.672926
24        0.520604
25        1.471212
26       -0.691999
27       -0.473971
28       -0.791576
29        1.408976
            ...
537547    0.443511
537548    2.326860
537549    0.752484
537550    0.466599
537551   -0.496055
537552    1.421624
537553    1.845433
537554   -0.448675
537555   -1.757844
537556   -1.435621
537557    0.680611
537558   -0.308744
537559   -0.313964
537560   -0.681358
537561   -0.301115
537562    0.436485
537563   -0.654456
537564   -0.451686
537565   -0.281039
537566   -0.799808
537567   -1.473565
537568   -0.683366
537569   -0.460118
537570    1.236120
537571    0.505547
537572    0.467804
537573    1.979943
537574   -0.259156
537575   -0.434019
537576   -0.493646
Name: Purchase, Length: 537577, dtype: float64